                          The Public MIXORIO License 1.0.
1. Общие положения.

1.1 Под словом "код" мы понимаем исходный код приложения а так же декомпилированные байты и т.д.
1.2 Под словом "приложение" мы понимаем бинарный исполняемый файл.
1.3 "Код" а так же "приложение" являются собственностью автора и их запрещенно присваивать полностью кому либо без согласия автора проекта а так же читайте нижние условия.
1.4 Под словами "указание авторства" мы понимаем ОТДЕЛЬНУЮ часть текста, зачастую строку, в котором указано Имя пользователя (Далее "Никнейм") Автора.
1.5 В примере как часть команды скобки строки "Автор исходного кода" ставятся в зависимости от таких же подписей с другой частью работы от участников команды. Если говорить проще то если у них есть скобки, то и у строки "Автор исходного кода" тоже должны быть.

2. Права пользователя.

2.1 Пользователь МОЖЕТ:
- Декомпилировать программы
- Деинтерпретировать программы
- Изменять исходные коды
- Распространять платное приложение как бесплатное в виде исходного кода
- Использовать до 50% включительно кода из проекта в своём БЕЗ указания на авторство кода.

2.2 Пользователь НЕ может:
- Выдавать от 51% включительно кода из данного проекта за чисто свой без указания авторства
- Присваивать авторство приложения себе
- Продавать изменённый код а так же изменённое приложение за сумму более 2 долларов USA.

3. Права автора проекта.

3.1 Автор проекта МОЖЕТ:
- Требовать указать авторство кода если из его проекта взято более 50% кода
- Требовать удалить проект который нарушает данную лицензию.

3.2 Автор проекта НЕ может:
- Применять безосновательные требования к проекту
- Нарушать самому эту лицензию.
- Препятствовать свободе которая выделена в данной лицензии.

4. Вариации указания авторства:
- Как часть команды, но с дописыванием (Автор исходного кода проекта). Пример:
Страница с командой создателей, на которой отдельно стоит Изображение профиля (далее "аватарка") автора исходного кода, ниже аватарки автора исходного кода никнейм автора исходного кода, ниже никнейма автора исходного кода пишется (Автор исходного кода проекта).
- Как чисто проценты кода автора исходного кода и сам автор исходного кода. Пример:
Просто отдельная строка с надписью -более (примерное количество процентов исходного кода осталось)% написано (Никнейм автора исходного кода проекта).
- В колоне "Отдельное Спасибо". Пример:
ОТДЕЛЬНОЕ СПАСИБО
(?) за (?)
(?) за (?)
(Автор исходного кода) за Исходный код использованный в проекте.
(?) за (?)
(?) за (?)
(?) за (?)
(?) за (?)
